# ProfileOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..ProfileOffset Property
PartMakerMethodToDivideVolumes Class See Also
---
The offset which is applied to a family-defined profile in the direction away from the division line and toward left/upper part to obtain its profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ProfileOffset { get; set; }
```

Visual Basic
---
```text
Public Property ProfileOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ProfileOffset {
	double get ();
	void set (double value);
}
```

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace